In [15]:
import pandas as pd
print(pd.__version__)

2.2.3

In [21]:
data = {
    "name": ['Rohim', 'Korim', 'Jabbae', 'Mina', 'Sajid', 'Faria', 'Tanim', 'Nusrat', 'Rafiq', 'Laila', 
             'Kamal', 'Shirin', 'Arif', 'Salma', 'Babul', 'Anika', 'Sohel', 'Hasina', 'Imran', 'Tasnim'],
    "age": [10, 20, 30, 25, 18, 22, 35, 28, 40, 15, 
            19, 27, 33, 12, 45, 23, 31, 29, 50, 17],
    "city": ['Dhaka', 'Cumilla', 'Sylhet', 'Chittagong', 'Rajshahi', 'Khulna', 'Barishal', 'Rangpur', 'Mymensingh', 'Narayanganj',
             'Gazipur', 'Dinajpur', 'Faridpur', 'Bogra', 'Pabna', 'Jessore', 'Tangail', 'Kushtia', 'Noakhali', 'Satkhira'],
    "food": 'no food'
}

df = pd.DataFrame(data)
df

      name  age         city     food
0    Rohim   10        Dhaka  no food
1    Korim   20      Cumilla  no food
2   Jabbae   30       Sylhet  no food
3     Mina   25   Chittagong  no food
4    Sajid   18     Rajshahi  no food
5    Faria   22       Khulna  no food
6    Tanim   35     Barishal  no food
7   Nusrat   28      Rangpur  no food
8    Rafiq   40   Mymensingh  no food
9    Laila   15  Narayanganj  no food
10   Kamal   19      Gazipur  no food
11  Shirin   27     Dinajpur  no food
12    Arif   33     Faridpur  no food
13   Salma   12        Bogra  no food
14   Babul   45        Pabna  no food
15   Anika   23      Jessore  no food
16   Sohel   31      Tangail  no food
17  Hasina   29      Kushtia  no food
18   Imran   50     Noakhali  no food
19  Tasnim   17     Satkhira  no food

In [22]:
df.head(3) #first theke koyta data nibo
df.tail(2) #last theke koyta data nibo
df.sample() # a randmon row
df.shape #find the shape of the data
df.columns #get the list of the column

Index(['name', 'age', 'city', 'food'], dtype='object')

In [23]:
#select column
df['name']

0      Rohim
1      Korim
2     Jabbae
3       Mina
4      Sajid
5      Faria
6      Tanim
7     Nusrat
8      Rafiq
9      Laila
10     Kamal
11    Shirin
12      Arif
13     Salma
14     Babul
15     Anika
16     Sohel
17    Hasina
18     Imran
19    Tasnim
Name: name, dtype: object

In [24]:
#multiple column
df[["name", "age"]]

      name  age
0    Rohim   10
1    Korim   20
2   Jabbae   30
3     Mina   25
4    Sajid   18
5    Faria   22
6    Tanim   35
7   Nusrat   28
8    Rafiq   40
9    Laila   15
10   Kamal   19
11  Shirin   27
12    Arif   33
13   Salma   12
14   Babul   45
15   Anika   23
16   Sohel   31
17  Hasina   29
18   Imran   50
19  Tasnim   17

In [25]:
#drop clumn
df.drop('food', axis=1)

      name  age         city
0    Rohim   10        Dhaka
1    Korim   20      Cumilla
2   Jabbae   30       Sylhet
3     Mina   25   Chittagong
4    Sajid   18     Rajshahi
5    Faria   22       Khulna
6    Tanim   35     Barishal
7   Nusrat   28      Rangpur
8    Rafiq   40   Mymensingh
9    Laila   15  Narayanganj
10   Kamal   19      Gazipur
11  Shirin   27     Dinajpur
12    Arif   33     Faridpur
13   Salma   12        Bogra
14   Babul   45        Pabna
15   Anika   23      Jessore
16   Sohel   31      Tangail
17  Hasina   29      Kushtia
18   Imran   50     Noakhali
19  Tasnim   17     Satkhira

In [27]:
#delete row
df.drop(1,axis=0)

      name  age         city     food
0    Rohim   10        Dhaka  no food
2   Jabbae   30       Sylhet  no food
3     Mina   25   Chittagong  no food
4    Sajid   18     Rajshahi  no food
5    Faria   22       Khulna  no food
6    Tanim   35     Barishal  no food
7   Nusrat   28      Rangpur  no food
8    Rafiq   40   Mymensingh  no food
9    Laila   15  Narayanganj  no food
10   Kamal   19      Gazipur  no food
11  Shirin   27     Dinajpur  no food
12    Arif   33     Faridpur  no food
13   Salma   12        Bogra  no food
14   Babul   45        Pabna  no food
15   Anika   23      Jessore  no food
16   Sohel   31      Tangail  no food
17  Hasina   29      Kushtia  no food
18   Imran   50     Noakhali  no food
19  Tasnim   17     Satkhira  no food